Tekla Open API Reference for Tekla Structures 2025
RectangleBoundingBox.AngleToAxis Property
 The angle of the bounding box in relation to the axis (the coordinate system's X-plane).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double AngleToAxis { get; }
Public ReadOnly Property AngleToAxis As Double
	Get
Property Value
Type: Double
See Also
Reference
RectangleBoundingBox Class
Tekla.Structures.Drawing Namespace